In [69]:
import pandas as pd

In [70]:
data = pd.read_csv('homeprice.csv')

In [71]:
data

               town  area   price  Unnamed: 3
0   monroe township  2600  550000         NaN
1   monroe township  3000  565000         NaN
2   monroe township  3200  610000         NaN
3   monroe township  3600  680000         NaN
4   monroe township  4000  725000         NaN
5      west windsor  2600  585000         NaN
6      west windsor  2800  615000         NaN
7      west windsor  3300  650000         NaN
8      west windsor  3600  710000         NaN
9       robinsville  2600  575000         NaN
10      robinsville  2900  600000         NaN
11      robinsville  3100  620000         NaN
12      robinsville  3600  695000         NaN

In [72]:
data.drop('Unnamed: 3',axis=1,inplace=True)

### Dummy Variable

In [73]:
town=pd.get_dummies(data.town,drop_first=True)

In [74]:
town

    robinsville  west windsor
0             0             0
1             0             0
2             0             0
3             0             0
4             0             0
5             0             1
6             0             1
7             0             1
8             0             1
9             1             0
10            1             0
11            1             0
12            1             0

In [75]:
data_new = pd.concat([data,town],axis=1)

In [76]:
data_new

               town  area   price  robinsville  west windsor
0   monroe township  2600  550000            0             0
1   monroe township  3000  565000            0             0
2   monroe township  3200  610000            0             0
3   monroe township  3600  680000            0             0
4   monroe township  4000  725000            0             0
5      west windsor  2600  585000            0             1
6      west windsor  2800  615000            0             1
7      west windsor  3300  650000            0             1
8      west windsor  3600  710000            0             1
9       robinsville  2600  575000            1             0
10      robinsville  2900  600000            1             0
11      robinsville  3100  620000            1             0
12      robinsville  3600  695000            1             0

In [77]:
data_new=data_new.drop('town',axis=1)

In [78]:
X = data_new.drop('price',axis=1)

In [79]:
y=data.price

In [80]:
X

    area  robinsville  west windsor
0   2600            0             0
1   3000            0             0
2   3200            0             0
3   3600            0             0
4   4000            0             0
5   2600            0             1
6   2800            0             1
7   3300            0             1
8   3600            0             1
9   2600            1             0
10  2900            1             0
11  3100            1             0
12  3600            1             0

In [81]:
y

0     550000
1     565000
2     610000
3     680000
4     725000
5     585000
6     615000
7     650000
8     710000
9     575000
10    600000
11    620000
12    695000
Name: price, dtype: int64

In [82]:
from sklearn.linear_model import LinearRegression

In [83]:
lr = LinearRegression()

In [84]:
lr.fit(X,y)

LinearRegression()

In [85]:
lr.predict(X)

array([539709.7398409 , 590468.71640507, 615848.20468716, 666607.18125134,
       717366.15781552, 579723.71533004, 605103.20361213, 668551.92431735,
       706621.15674048, 565396.1513653 , 603465.38378843, 628844.87207052,
       692293.59277575])

In [86]:
lr.score(X,y)

0.9573929037221872

In [87]:
lr.predict([[3400,0,0]])

array([641227.69296925])

### Label Encoder

In [88]:
from sklearn.preprocessing import LabelEncoder

In [89]:
le = LabelEncoder()

In [92]:
data_le = data

In [93]:
data_le.town = le.fit_transform(data_le.town)

In [94]:
data_le.town

0     0
1     0
2     0
3     0
4     0
5     2
6     2
7     2
8     2
9     1
10    1
11    1
12    1
Name: town, dtype: int32

In [95]:
data_le

    town  area   price
0      0  2600  550000
1      0  3000  565000
2      0  3200  610000
3      0  3600  680000
4      0  4000  725000
5      2  2600  585000
6      2  2800  615000
7      2  3300  650000
8      2  3600  710000
9      1  2600  575000
10     1  2900  600000
11     1  3100  620000
12     1  3600  695000

In [99]:
X = data_le.drop('price',axis=1)

In [100]:
X

    town  area
0      0  2600
1      0  3000
2      0  3200
3      0  3600
4      0  4000
5      2  2600
6      2  2800
7      2  3300
8      2  3600
9      1  2600
10     1  2900
11     1  3100
12     1  3600

In [101]:
y = data_le.price

In [102]:
y

0     550000
1     565000
2     610000
3     680000
4     725000
5     585000
6     615000
7     650000
8     710000
9     575000
10    600000
11    620000
12    695000
Name: price, dtype: int64

In [103]:
lr.fit(X,y)

LinearRegression()

In [105]:
lr.predict([[0,3400]])

array([642663.66016875])

In [106]:
lr.predict(X)

array([541819.90107652, 592241.78062264, 617452.72039569, 667874.59994181,
       718296.47948793, 582045.38842013, 607256.32819319, 670283.67762584,
       708100.08728542, 561932.64474833, 599749.05440791, 624959.99418097,
       687987.34361362])

In [107]:
lr.score(X,y)

0.9552018104317441

### One Hot Encoder

In [108]:
from sklearn.preprocessing import OneHotEncoder

In [112]:
from sklearn.compose import ColumnTransformer

In [113]:
ct = ColumnTransformer([('town', OneHotEncoder(), [0])], remainder = 'passthrough')

In [114]:
X = ct.fit_transform(X)

In [119]:
X

array([[1.0e+00, 0.0e+00, 0.0e+00, 2.6e+03],
       [1.0e+00, 0.0e+00, 0.0e+00, 3.0e+03],
       [1.0e+00, 0.0e+00, 0.0e+00, 3.2e+03],
       [1.0e+00, 0.0e+00, 0.0e+00, 3.6e+03],
       [1.0e+00, 0.0e+00, 0.0e+00, 4.0e+03],
       [0.0e+00, 0.0e+00, 1.0e+00, 2.6e+03],
       [0.0e+00, 0.0e+00, 1.0e+00, 2.8e+03],
       [0.0e+00, 0.0e+00, 1.0e+00, 3.3e+03],
       [0.0e+00, 0.0e+00, 1.0e+00, 3.6e+03],
       [0.0e+00, 1.0e+00, 0.0e+00, 2.6e+03],
       [0.0e+00, 1.0e+00, 0.0e+00, 2.9e+03],
       [0.0e+00, 1.0e+00, 0.0e+00, 3.1e+03],
       [0.0e+00, 1.0e+00, 0.0e+00, 3.6e+03]])

In [121]:
X = X[:,1:]

In [122]:
X

array([[0.0e+00, 0.0e+00, 2.6e+03],
       [0.0e+00, 0.0e+00, 3.0e+03],
       [0.0e+00, 0.0e+00, 3.2e+03],
       [0.0e+00, 0.0e+00, 3.6e+03],
       [0.0e+00, 0.0e+00, 4.0e+03],
       [0.0e+00, 1.0e+00, 2.6e+03],
       [0.0e+00, 1.0e+00, 2.8e+03],
       [0.0e+00, 1.0e+00, 3.3e+03],
       [0.0e+00, 1.0e+00, 3.6e+03],
       [1.0e+00, 0.0e+00, 2.6e+03],
       [1.0e+00, 0.0e+00, 2.9e+03],
       [1.0e+00, 0.0e+00, 3.1e+03],
       [1.0e+00, 0.0e+00, 3.6e+03]])

In [124]:
lr.fit(X,y)

LinearRegression()

In [125]:
lr.predict(X)

array([539709.7398409 , 590468.71640508, 615848.20468716, 666607.18125134,
       717366.15781552, 579723.71533004, 605103.20361213, 668551.92431735,
       706621.15674048, 565396.1513653 , 603465.38378843, 628844.87207052,
       692293.59277575])

In [126]:
lr.score(X,y)

0.9573929037221874

In [128]:
lr.predict([[0,1,3400]])

array([681241.6684584])